2024-02-12-git,-deshacer-el-ultimo-commit.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>git, eliminar el ultimo commit</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">12 feb 2024</div>
      <h1 class="post-title">
        <a
          href="https://martiyo.github.io/2024-02-12-git,-deshacer-el-ultimo-commit.html"
          >git, eliminar el ultimo commit</a
        >
      </h1>
      <p>Guía de cómo deshacer el último commit con git</p>

      <div id="outline-container-org81297b4" class="outline-2">
        <h2 id="org81297b4"># Antes de haber hecho push:</h2>
        <div class="outline-text-2" id="text-org81297b4">
          <p>Para mantener los cambios:</p>

          <pre class="example">
git reset --soft HEAD~1
</pre
          >

          <p>Para eliminar los cambios:</p>

          <pre class="example">
git reset --hard HEAD~1
</pre
          >

          <p>Para arreglar el commit (mensaje) o añadir cambios:</p>

          <pre class="example">
git commit -ammend -m "Mensaje corregido"
</pre
          >
        </div>
      </div>

      <div id="outline-container-orge0ebecf" class="outline-2">
        <h2 id="orge0ebecf"># Después de haber hecho push:</h2>
        <div class="outline-text-2" id="text-orge0ebecf">
          <p>Para crear un nuevo commit que invierte los cambios</p>

          <pre class="example">
git revert &lt;hash&gt;
</pre
          >

          <p>Para obtener el hash del commit a revertir:</p>

          <pre class="example">
git log
</pre
          >
        </div>
      </div>

      <div id="outline-container-org2b73106" class="outline-2">
        <h2 id="org2b73106"># Nivel experto:</h2>
        <div class="outline-text-2" id="text-org2b73106">
          <p>Modificar el orden del historial de commits localmente:</p>

          <pre class="example">
git rebase -i
</pre
          >

          <p>
            Con esto se puede cambiar el orden, combinar, editar, o eliminar
            commits.
          </p>

          <p>Después ejecutar:</p>

          <pre class="example">
git push --force-with-lease
</pre
          >

          <p>
            Sólo usa rebase y push forzado en ramas donde seas el único
            colaborador o en situaciones donde todos los colaboradores estén al
            tanto y de acuerdo en reescribir la historia.
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-git.html">git</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
